#В диапазоне натуральных чисел от 2 до 99 определить,
#сколько из них кратны каждому из чисел
#в диапазоне от 2 до 9.


a = list(range(2,100))
print(a)
x1 = x2 = x3 = x4 = x5 = x6 = x7 = x8 = 0
for i in range(98):
    if a[i] % 2 == 0:
        x1 = x1 + 1
    if a[i] % 4 == 0:
        x3 = x3 + 1
    if a[i] %8 == 0:
        x7 = x7 + 1
    if a[i] % 3 == 0:
        x2 = x2 + 1
    if a[i] % 6 == 0:
        x5 = x5 + 1
    if a[i] % 9 == 0:
        x8 = x8 + 1
    if a[i] % 5 == 0:
        x4 = x4 + 1
    if a[i] % 7 == 0:
        x6 = x6 + 1
print('Кратно-2: ', x1)
print('Кратно-3: ', x2)
print('Кратно-4: ', x3)
print('Кратно-5: ', x4)
print('Кратно-6: ', x5)
print('Кратно-7: ', x6)
print('Кратно-8: ', x7)
print('Кратно-9: ', x8)
